{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Tile/multiples", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_3_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_3_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_2_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_4_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_4_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_1_2/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_5_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_5_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_6_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/batch_normalization_6_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_7_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "8"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/conv2d_7_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Cast", "op": "Cast", "input": ["x"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_HALF"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/Cast"], "attr": {"SrcT": {"type": "DT_HALF"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/Cast", "StatefulPartitionedCall/u_net_nano_1/conv2d_1/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-16"}, {"size": "-18"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "8"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu", "StatefulPartitionedCall/u_net_nano_1/conv2d_1_2/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_1_2/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-14"}, {"size": "-16"}, {"size": "8"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "8"}, {"size": "16"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu_2", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_1", "StatefulPartitionedCall/u_net_nano_1/conv2d_2_1/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_2_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-9"}, {"size": "-11"}, {"size": "16"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "24"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu_3", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_2", "StatefulPartitionedCall/u_net_nano_1/conv2d_3_1/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_3_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-4"}, {"size": "-6"}, {"size": "24"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "32"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_3", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/ExpandDims", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/mul", "op": "Mul", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Reshape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/mul", "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/values_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/strided_slice_2", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Tile", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Reshape_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/ExpandDims", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Reshape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/mul", "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/values_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/strided_slice_2", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Tile", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1/Repeat_1/Reshape_1", "StatefulPartitionedCall/u_net_nano_1/Relu_2", "StatefulPartitionedCall/u_net_nano_1/concat/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu_4", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/concat", "StatefulPartitionedCall/u_net_nano_1/conv2d_4_1/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_4_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-4"}, {"size": "-6"}, {"size": "-26"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "56"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_4", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_4"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/ExpandDims", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/mul", "op": "Mul", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Reshape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/mul", "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/values_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/strided_slice_2", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Tile", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Reshape_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Tile", "op": "Tile", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/ExpandDims", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Tile/multiples"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2", "op": "StridedSlice", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Shape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Reshape", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/values_1_const_axis", "op": "Const", "input": ["^StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/mul"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/values_1", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/mul", "ConstantFolding/StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/values_1_const_axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/values_1", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/strided_slice_2", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Tile", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/u_net_nano_1/up_sampling2d_1_2/Repeat_1/Reshape_1", "StatefulPartitionedCall/u_net_nano_1/Relu_1", "StatefulPartitionedCall/u_net_nano_1/concat_1/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/Relu_5", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/u_net_nano_1/concat_1", "StatefulPartitionedCall/u_net_nano_1/conv2d_5_1/convolution/merged_input", "StatefulPartitionedCall/u_net_nano_1/batch_normalization_5_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-9"}, {"size": "-11"}, {"size": "-32"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "8"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/u_net_nano_1/Relu_5", "StatefulPartitionedCall/u_net_nano_1/up_sampling2d_2_1/Repeat/ExpandDims/dim"], "attr": 